{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Frank and Marcos de Leon had very different memories of certain experiences from their childhoods. While both men discuss how much their community changed over time, Frank does not recall the things like the construction of I-35 as having much of an effect on him, while Marcos recalls in detail how it caused certain institutions, like the church building his mother helped to found, to disappear. Frank also doesn’t think that his childhood was very political, while Marcos was aware of and involved in politics like the Chicano Movement, a Mexican American Civil Rights movement in the 1960s and 70s, from a young age and continues to be politically involved today. They show how memory is a powerful thing in the legacies that community and places leave behind. Both the men’s oral histories provide rich, vivid detail about what life was like for Mexican American children in the mid 20th century, demonstrating the value of this type of source in historical work. They remember Palm fondly, and give insight into why the Mexican American community is working to preserve it today."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "image",
      "url": "https://archive.org/download/rgz-6819/_RGZ6819.jpg",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“Portrait of Marcos de Leon and Frank de Leon, Jr.” Photo courtesy of the Palm School Oral History Project, 2024. Travis County Archives in Austin, Texas, Marcos de Leon."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "This project was created by Kara Alexandra Culp, a History PhD student at the University of Texas at Austin. Her research involves Latino education history in the state of Texas and she is passionate about public history. If you have any comments or questions, you can reach her at karaculp@utexas.edu"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Published January 6, 2026"
        }
      ]
    }
  ],
  "title": "Conclusion",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "conclusion",
  "created_at": "2026-01-03T01:42:48.374Z",
  "created_by": "karaculp",
  "updated_at": "2026-01-24T03:18:13.337Z",
  "updated_by": "karaculp"
}