{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "There are a number of tags which designate what information is where in the oral history videos. Their titles and tag groups make the information easier to find for individuals that are looking for specific information or content. You can filter for certain information in each of the videos to find what is most related to your research interests, or if you would like, you can watch the entire videos to hear the de Leon's entire stories then use the tags to go back to certain points later."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“"
        },
        {
          "text": "Introductions and Endings",
          "bold": true
        },
        {
          "text": "” includes tags that introduce the oral history and its participants, such as “Interviewer Introduction” and “Interviewee Introduction,” as well as those that end the interview."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“"
        },
        {
          "text": "Interviewer Question",
          "bold": true
        },
        {
          "text": "” includes all questions asked by the interviewer to the interviewee, such as “Question About Family Life” or “Question About Neighborhood.\""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“"
        },
        {
          "text": "Life of Interviewee",
          "bold": true
        },
        {
          "text": "” includes tags where the interviewee talks about their personal life, such as “Family Life,” \"Religious Beliefs,” and “Career.” It also includes the “Education Expectations” tag, where the interviewee discusses the expectations about education that they had for themselves, that their teachers and family had for them, and how these expectations changed over time."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“"
        },
        {
          "text": "Places of Austin",
          "bold": true
        },
        {
          "text": "” includes all tags which discuss different locations in Austin, such as “Streets of Austin,” “Businesses of Austin,” and \"Neighborhood.” May prove useful to those looking for information on what Austin was like in the 50s and 60s, including the locations of certain places and the purposes they served."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“"
        },
        {
          "text": "Palm School",
          "bold": true
        },
        {
          "text": "” includes tags that discuss people and events specific to Palm School, such as “Description of Palm School,” “Classmates,” “School Staff,” and more."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“"
        },
        {
          "text": "Community and Culture",
          "bold": true
        },
        {
          "text": ",” discusses the community the interviewees grew up in as in the people it contained, not just the physical environment. It includes tags like “Language Use,” and covers when the interviewee discusses things that made up the culture of their community such as language, food, and dancing."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“"
        },
        {
          "text": "Discrimination",
          "bold": true
        },
        {
          "text": "” covers all tags which include different types of discrimination present in the Mexican American communities of Austin in the mid-20th century, such as “Language Erasure” (Mexican Americans not being allowed to use Spanish), “Housing Discrimination” (Poor road conditions, lack of services, or zoning of industrial facilities like a maintenance plant in the neighborhood where Mexican Americans lived), and “Segregation.”"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“"
        },
        {
          "text": "Education Beyond Palm",
          "bold": true
        },
        {
          "text": "” includes tags when the interviewee discussed their education after leaving elementary school in Junior High, High School, and University."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "“"
        },
        {
          "text": "Context and Commentary",
          "bold": true
        },
        {
          "text": "” is additional context provided by the project creator on things that the interviewee mentions briefly. For the most part, this includes historical context."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\n\n\n\n\n\n\n\n\n\n"
        }
      ]
    }
  ],
  "title": "Guide to Tags",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "guide-to-tags",
  "created_at": "2026-01-02T18:51:33.764Z",
  "created_by": "karaculp",
  "updated_at": "2026-01-05T23:44:56.159Z",
  "updated_by": "karaculp"
}