{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": "This project analyzes the lives of two brothers, Frank de Leon Jr. and Marcos de Leon, who attended Palm School, University Junior High, And Stephen F. Austin High School in Austin Texas during the 1950s and 60s. The brothers grew up in the heavily Mexican American area of the East Austin Neighborhood. These oral histories document their childhoods and adulthoods, and how they were affected by their educations and the community they grew up in. They describe their home lives with their family, neighborhood, and community. Within their lives, they experienced elements of institutional discrimination, such as their community being displaced by the construction of I-35, not being allowed to speak their Spanish in school, and their neighborhood lacking paved roads and being zoned to include industrial facilities. It also includes personal experiences with discrimination on the part of classmates, community members, and teachers. Still, the brothers also note important moments of connection that came from their schools and community which they cherish to this day."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "image",
      "url": "https://archive.org/download/rgz-6811/_RGZ6811.jpg",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Marcos de Leon (left) and Frank de Leon Jr. (right). “Portrait of Frank de Leon, Jr. and Marcos de Leon.” Photo courtesy of the Palm School Oral History Project, 2024. Travis County Archives in Austin, Texas, de Leon Jr., Frank."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "This project is based on two oral histories, which gathers historical information by interviewing people who were directly involved with the people, places, or events researchers are analyzing. Oral histories are incredibly valuable, as they give voice to people who may have been “silenced” in history by not being able to create documents from their own perspectives at the time the events took place. They also provide rich personal details which are not often recorded in official documents. Still, they are subject to memory. One interesting thing to note while watching these interviews is how differently Frank and his younger brother Marcos remember some of the same events, such as the Civil Rights Movement, or how much of an effect an event had on one brother and not the other. The tags notate this with clear organization, and are intended to be useful to anyone from a scholar looking to analyze certain parts of Austin or Mexican American’s history, to individuals who seek to learn more about certain places or events. See \"Guide to Tags\" and \"Places of the Project\" for more guidance."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "The oral histories were conducted by the Voces Oral History Institute at UT Austin in partnership with Travis County, who funded their creation. Travis County has created a steering committee to help decide the future of the Palm School building, of which Marcos de Leon is a member."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "\n\n\n"
        }
      ]
    }
  ],
  "title": "Introduction",
  "autogenerate": {
    "enabled": false,
    "type": "custom"
  },
  "slug": "introduction",
  "created_at": "2026-01-03T17:58:13.879Z",
  "created_by": "karaculp",
  "updated_at": "2026-01-05T23:42:32.540Z",
  "updated_by": "karaculp"
}